In [23]:
# Kevin R. Salger
# 9/26/2021
# IS 670 Business Intelligence
# Homework 3, Ch7, #23
#####################################

#        1         2         3         4         5         6         7
#23456789012345678901234567890123456789012345678901234567890123456789012
# Perform the following tasks with pandas DataFrames:
# a) Create a DataFrame named temperatures from a dictionary of three
#    temperature readings each for 'Maxine', 'James', and 'Amanda'.
# b) Recreate the DataFrame temperatures in Part (a) with custom indices
#    using the index keyword argument and a list containing 'Morning', 
#    'Afternoon', and 'Evening'.
# c) Select from temperatures the column of temperature readings for 
#    'Maxine'.
# d) Select from temperatures the row of 'Morning' temperature readings.
# e) Select from temperatures the rows for 'Morning' and 'Evening'
#    temperature readings.
# f) Select from temperatures the columns of temperature readings for
#    'Amanda' and 'Maxine'.
# g) Select from temperatures the elements for 'Amanda' and 'Maxine' in
#    the 'Morning' and 'Afternoon'.
# h) Use the describe method to produce temperatures' descriptive statistics.
# i) Transpose temperatures.
# j) Sort temperatures so that its column names are in alphabetical order.

import pandas as pd
import numpy as np

In [24]:
# a) Create a DataFrame named temperatures from a dictionary of three
#    temperature readings each for 'Maxine', 'James', and 'Amanda'.
skala_ordbok = {'Maxine':[71, 74, 77], 'James':[82, 85, 88], 'Amanda':[93, 96, 99]}
temperatures = pd.DataFrame(skala_ordbok)
temperatures

   Maxine  James  Amanda
0      71     82      93
1      74     85      96
2      77     88      99

In [25]:
# b) Recreate the DataFrame temperatures in Part (a) with custom indices
#    using the index keyword argument and a list containing 'Morning', 
#    'Afternoon', and 'Evening'.
temperatures.index = ['Morning', 'Afternoon', 'Evening']
temperatures

           Maxine  James  Amanda
Morning        71     82      93
Afternoon      74     85      96
Evening        77     88      99

In [26]:
# c) Select from temperatures the column of temperature readings for 
#    'Maxine'.
temperatures['Maxine']

Morning      71
Afternoon    74
Evening      77
Name: Maxine, dtype: int64

In [27]:
# d) Select from temperatures the row of 'Morning' temperature readings.
temperatures.loc['Morning']

Maxine    71
James     82
Amanda    93
Name: Morning, dtype: int64

In [28]:
# e) Select from temperatures the rows for 'Morning' and 'Evening'
#    temperature readings.
temperatures.loc[['Morning','Evening']]

         Maxine  James  Amanda
Morning      71     82      93
Evening      77     88      99

In [29]:
# f) Select from temperatures the columns of temperature readings for
#    'Amanda' and 'Maxine'.
temperatures[['Amanda', 'Maxine']]

           Amanda  Maxine
Morning        93      71
Afternoon      96      74
Evening        99      77

In [30]:
# g) Select from temperatures the elements for 'Amanda' and 'Maxine' in
#    the 'Morning' and 'Afternoon'.
temperatures.loc[['Morning','Afternoon'],['Amanda','Maxine']]

           Amanda  Maxine
Morning        93      71
Afternoon      96      74

In [31]:
# h) Use the describe method to produce temperatures' descriptive statistics.
temperatures.describe()

       Maxine  James  Amanda
count     3.0    3.0     3.0
mean     74.0   85.0    96.0
std       3.0    3.0     3.0
min      71.0   82.0    93.0
25%      72.5   83.5    94.5
50%      74.0   85.0    96.0
75%      75.5   86.5    97.5
max      77.0   88.0    99.0

In [32]:
# i) Transpose temperatures.
temperatures.T

        Morning  Afternoon  Evening
Maxine       71         74       77
James        82         85       88
Amanda       93         96       99

In [33]:
# j) Sort temperatures so that its column names are in alphabetical order.
temperatures.sort_index(axis=1)

           Amanda  James  Maxine
Morning        93     82      71
Afternoon      96     85      74
Evening        99     88      77